# Работа с данными в numpy
### Задание 1

In [5]:
import numpy as np
a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1, 7]])
mean_a = np.array(np.mean(a, axis = 0))
mean_a

array([2. , 8.4])

### Задание 2

In [7]:
a_centered = mean_a - a
a_centered

array([[ 1. ,  2.4],
       [ 0. ,  0.4],
       [-1. , -2.6],
       [-1. , -1.6],
       [ 1. ,  1.4]])

### Задание 3

In [17]:
a1 = np.array(a_centered[:, 0])
a2 = np.array(a_centered[:, 1])
a_centered_sp = np.dot(a1, a2)
a_centered_sp

8.0

In [21]:
N = a_centered.shape[0]
a_centered_sp / (N-1)

2.0

# Работа с данными в pandas
### Задание 1

In [24]:
import numpy as np
import pandas as pd
authors = pd.DataFrame({'author_id': [1, 2, 3],
                       'author_name': ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                       'price': [450, 300, 350, 500, 450, 370, 290]})

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [27]:
#Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [34]:
#Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.
top5 = pd.DataFrame(authors_price.nlargest(5, 'price'))
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4

In [55]:
#Создайте датафрейм authors_stat на основе информации из authors_price. 
#В датафрейме authors_stat должны быть четыре столбца: author_name, min_price, max_price и mean_price,
#в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги 
#этого автора.
authors_stat1 = authors_price.groupby('author_name').agg({'price': 'max'})
authors_stat1 = authors_stat1.rename(columns = {'price': 'max_price'})

authors_stat2 = authors_price.groupby('author_name').agg({'price': 'min'})
authors_stat2 = authors_stat2.rename(columns = {'price': 'min_price'})

authors_stat3 = authors_price.groupby('author_name').agg({'price': 'mean'})
authors_stat3 = authors_stat3.rename(columns = {'price': 'mean_price'})

authors_stat4 = pd.merge(authors_stat1, authors_stat2, on = 'author_name', how = 'inner')
authors_stat = pd.merge(authors_stat4, authors_stat3, on = 'author_name', how = 'inner')
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000